system/blockMeshDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	blockMeshDict;
}
vertices	(
	(0.0 0.0 0.0)
	(0.085 0.0 0.0)
	(0.085 0.056 0.0)
	(0.0 0.056 0.0)
	(0.0 0.0 0.0155)
	(0.085 0.0 0.0155)
	(0.085 0.056 0.0155)
	(0.0 0.056 0.0155)
);
blocks	(
	hex	(0 1 2 3 4 5 6 7) (15 10 5) simpleGrading (1.0 1.0 1.0)
);
edges	();
boundary	(
	boundaries
	{
		type	wall;
		faces	(
			(0 4 7 3)
			(2 6 5 1)
			(1 5 4 0)
			(3 7 6 2)
			(0 3 2 1)
			(4 5 6 7)
		);
	}
);
