constant/Solid/polyMesh/boundary
FoamFile
{
	version	2.0;
	format	ascii;
	class	polyBoundaryMesh;
	location	"constant/solid/polyMesh";
	object	boundary;
}
2
(
	board
	{
		type	wall;
		startFace	9045;
		nFaces	684;
		inGroups	(viewFactorWall);
	}
	cpu
	{
		type	mappedWall;
		sampleRegion	Fluid;
		samplePatch	cpu;
		sampleMode	nearestPatchFace;
		offsetMode	uniform;
		offset	(0.0 0.0 0.0);
		startFace	9729;
		nFaces	1554;
		inGroups	(viewFactorWall);
	}
)
