constant/Solid/thermophysicalProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant/solid";
	object	thermophysicalProperties;
}
thermoType
{
	type	heSolidThermo;
	mixture	pureMixture;
	transport	constIso;
	thermo	hConst;
	equationOfState	rhoConst;
	specie	specie;
	energy	sensibleEnthalpy;
}
mixture
{
	specie
	{
		nMoles	1.0;
		molWeight	26.98;
	}
	thermodynamics
	{
		Cp	910.0;
		Hf	0.0;
	}
	transport
	{
		kappa	205.0;
	}
	equationOfState
	{
		rho	2712.0;
	}
}
