0/Fluid/U
FoamFile
{
	version	2.0;
	format	binary;
	class	volVectorField;
	location	"0/fluid";
	object	U;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 1 -1 0 0 0 0];
internalField	uniform (0.0 0.0 0.0);
boundaryField
{
	boundaries
	{
		type	noSlip;
	}
	board
	{
		type	noSlip;
	}
	cpu
	{
		type	noSlip;
	}
	fan
	{
		type	noSlip;
	}
	fan_inlet
	{
		type	surfaceNormalFixedValue;
		refValue	uniform -0.1;
	}
	outlet
	{
		type	pressureInletOutletVelocity;
		value	uniform (0.0 0.0 0.0);
	}
}
