0/Fluid/T
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/fluid";
	object	T;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 0 0 1 0 0 0];
internalField	uniform 300.0;
boundaryField
{
	boundaries
	{
		type	zeroGradient;
	}
	board
	{
		type	zeroGradient;
	}
	cpu
	{
		type	compressible::turbulentTemperatureRadCoupledMixed;
		value	uniform 300.0;
		qrNbr	none;
		qr	qr;
		neighbourFieldName	T;
		kappaMethod	fluidThermo;
		kappa	none;
		Tnbr	T;
		thicknessLayers	();
		kappaLayers	();
	}
	fan
	{
		type	zeroGradient;
	}
	fan_inlet
	{
		type	totalTemperature;
		T0	uniform 300.0;
		gamma	1.4;
	}
	outlet
	{
		type	inletOutlet;
		inletValue	uniform 300.0;
	}
}
