0/Fluid/alphat
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/fluid";
	object	alphat;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 -1 -1 0 0 0 0];
internalField	uniform 0.0;
boundaryField
{
	boundaries
	{
		type	compressible::alphatJayatillekeWallFunction;
		value	uniform 0.0;
		Prt	0.85;
	}
	board
	{
		type	compressible::alphatJayatillekeWallFunction;
		value	uniform 0.0;
		Prt	0.85;
	}
	cpu
	{
		type	compressible::alphatJayatillekeWallFunction;
		value	uniform 0.0;
		Prt	0.85;
	}
	fan
	{
		type	compressible::alphatJayatillekeWallFunction;
		value	uniform 0.0;
		Prt	0.85;
	}
	fan_inlet
	{
		type	calculated;
		value	uniform 0.0;
	}
	outlet
	{
		type	calculated;
		value	uniform 0.0;
	}
}
