0/Fluid/k
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/fluid";
	object	k;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 2 -2 0 0 0 0];
internalField	uniform 0.009999999776482582;
boundaryField
{
	boundaries
	{
		type	kqRWallFunction;
		value	uniform 0.009999999776482582;
	}
	board
	{
		type	kqRWallFunction;
		value	uniform 0.009999999776482582;
	}
	cpu
	{
		type	kqRWallFunction;
		value	uniform 0.009999999776482582;
	}
	fan
	{
		type	kqRWallFunction;
		value	uniform 0.009999999776482582;
	}
	fan_inlet
	{
		type	turbulentIntensityKineticEnergyInlet;
		value	uniform 0.009999999776482582;
		intensity	0.05;
	}
	outlet
	{
		type	zeroGradient;
	}
}
