0/Fluid/nut
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/fluid";
	object	nut;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 2 -1 0 0 0 0];
internalField	uniform 0.10999999940395355;
boundaryField
{
	boundaries
	{
		type	nutUWallFunction;
		value	uniform 0.10999999940395355;
	}
	board
	{
		type	nutUWallFunction;
		value	uniform 0.10999999940395355;
	}
	cpu
	{
		type	nutUWallFunction;
		value	uniform 0.10999999940395355;
	}
	fan
	{
		type	nutUWallFunction;
		value	uniform 0.10999999940395355;
	}
	fan_inlet
	{
		type	calculated;
		value	uniform 0.10999999940395355;
	}
	outlet
	{
		type	calculated;
		value	uniform 0.10999999940395355;
	}
}
