0/Fluid/qr
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/fluid";
	object	Qr;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 0 -3 0 0 0 0];
internalField	uniform 0.0;
boundaryField
{
	boundaries
	{
		type	greyDiffusiveRadiationViewFactor;
		value	uniform 0.0;
		qro	uniform 0.0;
		T	T;
	}
	board
	{
		type	greyDiffusiveRadiationViewFactor;
		value	uniform 0.0;
		qro	uniform 0.0;
		T	T;
	}
	cpu
	{
		type	greyDiffusiveRadiationViewFactor;
		value	uniform 0.0;
		qro	uniform 0.0;
		T	T;
	}
	fan
	{
		type	greyDiffusiveRadiationViewFactor;
		value	uniform 0.0;
		qro	uniform 0.0;
		T	T;
	}
	fan_inlet
	{
		type	calculated;
		value	uniform 0.0;
	}
	outlet
	{
		type	calculated;
		value	uniform 0.0;
	}
}
