0/Solid/T
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/solid";
	object	T;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 0 0 1 0 0 0];
internalField	uniform 300.0;
boundaryField
{
	board
	{
		type	zeroGradient;
	}
	cpu
	{
		type	compressible::turbulentTemperatureRadCoupledMixed;
		value	uniform 300.0;
		qrNbr	qr;
		qr	none;
		neighbourFieldName	T;
		kappaMethod	solidThermo;
		kappa	none;
		Tnbr	T;
	}
}
