system/Fluid/fvSolution
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system/Fluid";
	object	fvSolution;
}
solvers
{
	p_rgh
	{
		solver	GAMG;
		smoother	GaussSeidel;
		relTol	0.01;
		cacheAgglomeration	true;
		nFinestSweeps	2;
		nPreSweeps	0;
		maxIter	100;
		nPostSweeps	1;
		agglomerator	faceAreaPair;
		nCellsInCoarsestLevel	10;
		tolerance	1.0E-6;
		mergeLevels	1;
	}
	U
	{
		solver	PBiCGStab;
		relTol	0.01;
		preconditioner	DILU;
		tolerance	1.0E-6;
		maxIter	100;
	}
	h
	{
		solver	PBiCGStab;
		relTol	0.01;
		preconditioner	DILU;
		tolerance	1.0E-6;
		maxIter	100;
	}
	rho
	{
		solver	PCG;
		relTol	0.01;
		preconditioner	DIC;
		tolerance	1.0E-6;
		maxIter	100;
	}
	k
	{
		solver	PBiCGStab;
		relTol	0.01;
		preconditioner	DILU;
		tolerance	1.0E-6;
		maxIter	100;
	}
	epsilon
	{
		solver	PBiCGStab;
		relTol	0.01;
		preconditioner	DILU;
		tolerance	1.0E-6;
		maxIter	100;
	}
}
SIMPLE
{
	nNonOrthogonalCorrectors	2;
	momentumPredictor	true;
	residualControl
	{
		p_rgh	1.0E-4;
		U	1.0E-4;
		h	1.0E-4;
		rho	1.0E-4;
		k	1.0E-4;
		epsilon	1.0E-4;
	}
	pRefCell	0;
	pRefValue	100000.0;
}
relaxationFactors
{
	p_rgh	0.3;
	U	0.4;
	h	1.0;
	rho	0.8;
	k	0.8;
	epsilon	0.8;
}
