system/Solid/fvSolution
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system/Solid";
	object	fvSolution;
}
solvers
{
	h
	{
		solver	PCG;
		relTol	0.01;
		preconditioner	DIC;
		tolerance	1.0E-8;
		maxIter	100;
	}
}
SIMPLE
{
	nNonOrthogonalCorrectors	1;
	residualControl
	{
		p_rgh	1.0E-4;
		U	1.0E-4;
		h	1.0E-4;
		rho	1.0E-4;
		k	1.0E-4;
		epsilon	1.0E-4;
	}
}
relaxationFactors
{
	h	1.0;
}
