system/Solid/fvOptions
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system/Solid";
	object	fvOptions;
}
scalarSource
{
	active	true;
	type	scalarSemiImplicitSource;
	scalarSemiImplicitSourceCoeffs
	{
		volumeMode	specific;
		selectionMode	all;
		injectionRateSuSp
		{
			h	(1250000.0 0.0);
		}
	}
}
temperatureLimit
{
	active	true;
	type	limitTemperature;
	limitTemperatureCoeffs
	{
		min	290.0;
		max	600.0;
		selectionMode	all;
	}
}
